Tekla Open API Reference for Tekla Structures 2025
MeshItem Properties
The MeshItem type exposes the following members.
Properties
Name | Description
DiameterCross
 The mesh item's cross direction bar size.
DiameterLongitudinal
 The mesh item's longitudinal direction bar size.
DistanceCross
 The mesh item's cross direction distance.
DistanceLongitudinal
 The mesh item's longitudinal direction distance.
Grade
 The mesh item's grade.
LeftOverhangCross
 The mesh item's cross direction left overhang.
LeftOverhangLongitudinal
 The mesh item's longitudinal direction left overhang.
Length
 The mesh item's length.
MaximumOverlappingCross
 The mesh item's cross direction maximum overlapping.
MaximumOverlappingLongitudinal
 The mesh item's longitudinal direction maximum overlapping.
MinimumOverlappingCross
 The mesh item's cross direction minimum overlapping.
MinimumOverlappingLongitudinal
 The mesh item's longitudinal direction minimum overlapping.
Name
 The mesh item's name.
RightOverhangCross
 The mesh item's cross direction right overhang.
RightOverhangLongitudinal
 The mesh item's longitudinal direction right overhang.
Width
 The mesh item's width.
Top
See Also
Reference
MeshItem Class
Tekla.Structures.Catalogs Namespace